DiffusiveMixing/H-mixer/14deg/cL10/U0.1/flowField/system/blockMeshDict
FoamFile
{
	format      ascii;
	class       dictionary;
	object      blockMeshDict;
}

convertToMeters 1;

vertices (
	(-0.00001212678125181664 0.00004850712500726660 0)
	(0.00001212678125181664 -0.00004850712500726660 0)
	(0.00200615528128088435 0.00044999999999999999 0)
	(0.00179384471871911824 0.00050000000000000001 0)
	(0.00001212678125181664 0.00104850712500726665 0)
	(-0.00001212678125181664 0.00095149287499273340 0)
	(0.00200615528128088435 0.00055000000000000003 0)
	(0.00000000000000000000 0.00000000000000000000 0)
	(0.01199384471871911551 0.00044999999999999999 0)
	(0.00000000000000000000 0.00000000000000000000 0)
	(0.01220615528128088205 0.00050000000000000001 0)
	(0.01398787321874818412 -0.00004850712500726660 0)
	(0.01401212678125181646 0.00004850712500726660 0)
	(0.01199384471871911551 0.00055000000000000003 0)
	(0.01401212678125181646 0.00095149287499273340 0)
	(0.01398787321874818412 0.00104850712500726665 0)
	(-0.00001212678125181664 0.00004850712500726660 0.0001)
	(0.00001212678125181664 -0.00004850712500726660 0.0001)
	(0.00200615528128088435 0.00044999999999999999 0.0001)
	(0.00179384471871911824 0.00050000000000000001 0.0001)
	(0.00001212678125181664 0.00104850712500726665 0.0001)
	(-0.00001212678125181664 0.00095149287499273340 0.0001)
	(0.00200615528128088435 0.00055000000000000003 0.0001)
	(0.00000000000000000000 0.00000000000000000000 0.0001)
	(0.01199384471871911551 0.00044999999999999999 0.0001)
	(0.00000000000000000000 0.00000000000000000000 0.0001)
	(0.01220615528128088205 0.00050000000000000001 0.0001)
	(0.01398787321874818412 -0.00004850712500726660 0.0001)
	(0.01401212678125181646 0.00004850712500726660 0.0001)
	(0.01199384471871911551 0.00055000000000000003 0.0001)
	(0.01401212678125181646 0.00095149287499273340 0.0001)
	(0.01398787321874818412 0.00104850712500726665 0.0001)
	(0.00200615528128088435 0.00050000000000000001 0)
	(0.01199384471871911551 0.00050000000000000001 0)
	(0.00181809828122275145 0.00040298574998546682 0)
	(0.00181809828122275145 0.00059701425001453326 0)
	(0.01218190171877724798 0.00040298574998546682 0)
	(0.01218190171877724798 0.00059701425001453326 0)
	(0.00200615528128088435 0.00050000000000000001 0.0001)
	(0.01199384471871911551 0.00050000000000000001 0.0001)
	(0.00181809828122275145 0.00040298574998546682 0.0001)
	(0.00181809828122275145 0.00059701425001453326 0.0001)
	(0.01218190171877724798 0.00040298574998546682 0.0001)
	(0.01218190171877724798 0.00059701425001453326 0.0001)
);

blocks (
	hex (0 1 34 3 16 17 40 19) (80 896 1) simpleGrading (1 1 1)
	hex (4 5 3 35 20 21 19 41) (80 896 1) simpleGrading (1 1 1)
	hex (6 32 33 13 22 38 39 29) (80 800 1) simpleGrading (1 1 1)
	hex (32 2 8 33 38 18 24 39) (80 800 1) simpleGrading (1 1 1)
	hex (10 36 11 12 26 42 27 28) (80 896 1) simpleGrading (1 1 1)
	hex (37 10 14 15 43 26 30 31) (80 896 1) simpleGrading (1 1 1)
	hex (3 32 6 35 19 38 22 41) (40 80 1) simpleGrading (1 1 1)
	hex (3 34 2 32 19 40 18 38) (80 40 1) simpleGrading (1 1 1)
	hex (33 8 36 10 39 24 42 26) (80 40 1) simpleGrading (1 1 1)
	hex (33 10 37 13 39 26 43 29) (40 80 1) simpleGrading (1 1 1)
);

edges (
);

boundary (
	walls {
		type wall;
		faces (
			(1 34 17 40)
			(3 0 19 16)
			(5 3 21 19)
			(35 4 41 20)
			(2 8 18 24)
			(13 6 29 22)
			(36 11 42 27)
			(12 10 28 26)
			(10 14 26 30)
			(15 37 31 43)
			(34 2 40 18)
			(35 6 41 22)
			(8 36 24 42)
			(13 37 29 43)
		);
	}
	inlet_0 {
		type patch;
		faces (
			(0 1 16 17)
		);
	}
	inlet_1 {
		type patch;
		faces (
			(4 5 20 21)
		);
	}
	outlet_0 {
		type patch;
		faces (
			(11 12 27 28)
		);
	}
	outlet_1 {
		type patch;
		faces (
			(14 15 30 31)
		);
	}
);
